AEyeSecurity/ESP32_SALUS/src/pi_comms.cpp
String describeSpeedTelemetry(uint16_t speedCentiMps) {
  if (speedCentiMps == kSpeedTelemetryNotAvailable) {
    return "N/A";
  }
  String msg = String(static_cast<float>(speedCentiMps) / 100.0f, 2);
  msg += "m/s";
  return msg;
}

String describeSteerTelemetry(int16_t steerCentiDeg) {
  if (steerCentiDeg == kSteerTelemetryNotAvailable) {
    return "N/A";
  }
  String msg = String(static_cast<float>(steerCentiDeg) / 100.0f, 2);
  msg += "deg";
  return msg;
}

String describeBatteryFlags(uint8_t flags) {
  String msg;
  appendFlag(msg, (flags & kBatteryStatusReady) != 0, "READY");
  appendFlag(msg, (flags & kBatteryStatusFresh) != 0, "FRESH");
  appendFlag(msg, (flags & kBatteryStatusSuspect) != 0, "SUSPECT");
  appendFlag(msg, (flags & kBatteryStatusCalibrated) != 0, "CAL");

  String out;
  out.reserve(64);
  out += "flags=0x";
  out += String(flags, HEX);
  out += " (";
  out += (msg.length() > 0) ? msg : "none";
  out += ")";
  return out;
}

uint8_t encodeBatteryFlags(const BatterySnapshot& snapshot, TickType_t nowTick, TickType_t samplePeriod) {
  uint8_t flags = 0;
  if (snapshot.driverReady && snapshot.sampleCount > 0) {
    flags |= kBatteryStatusReady;
  }

  if (snapshot.driverReady) {
    flags |= kBatteryStatusCalibrated;
  }

  if (snapshot.sampleCount > 0) {
    TickType_t freshnessWindow = samplePeriod;
    if (freshnessWindow == 0) {
      freshnessWindow = pdMS_TO_TICKS(5000);
    }
    freshnessWindow *= kBatteryFreshFactor;
    const TickType_t ageTicks = nowTick - snapshot.sampleTick;
    if (ageTicks <= freshnessWindow) {
      flags |= kBatteryStatusFresh;
    }
  }

  if (snapshot.adcPinMv >= kBatterySuspectAdcThresholdMv || snapshot.batteryMv == 0u) {
    flags |= kBatteryStatusSuspect;
  }

  return flags;
}

uint8_t encodeBatterySampleAgeDs(const BatterySnapshot& snapshot, TickType_t nowTick) {
  if (snapshot.sampleCount == 0) {
    return std::numeric_limits<uint8_t>::max();
  }
  const TickType_t ageTicks = nowTick - snapshot.sampleTick;
  const uint32_t ageMs = static_cast<uint32_t>(ageTicks * portTICK_PERIOD_MS);
  return clampToU8((ageMs + 50u) / 100u);
}

uint16_t encodeSpeedTelemetryFromHall() {
  HallSpeedSnapshot speed{};
  if (!hallSpeedGetSnapshot(speed) || !speed.driverReady || !isfinite(speed.speedMps)) {
    return kSpeedTelemetryNotAvailable;
  }

  const float speedMps = fabsf(speed.speedMps);

  long speedCenti = lroundf(speedMps * 100.0f);
  if (speedCenti < 0) {
    speedCenti = 0;
  } else if (speedCenti > 65534L) {
    speedCenti = 65534L;
  }
  return static_cast<uint16_t>(speedCenti);
}

int16_t encodeSteerTelemetryCentered() {
  PidRuntimeSnapshot pidSnapshot{};
  if (!pidGetRuntimeSnapshot(pidSnapshot) || !pidSnapshot.valid || !pidSnapshot.sensorValid ||
      !isfinite(pidSnapshot.measuredDeg)) {
    return kSteerTelemetryNotAvailable;
  }

  const SteeringCalibrationData calibration = steeringCalibrationSnapshot();
  const float centerDeg = calibration.initialized ? calibration.adjustedCenterDeg : 0.0f;
  float centeredDeg = wrapAngleDegrees(pidSnapshot.measuredDeg - centerDeg);
  if (!isfinite(centeredDeg)) {
    return kSteerTelemetryNotAvailable;
  }

  if (centeredDeg < -180.0f) {
    centeredDeg = -180.0f;
  } else if (centeredDeg > 180.0f) {
    centeredDeg = 180.0f;
  }

  long centeredCenti = lroundf(centeredDeg * 100.0f);
  if (centeredCenti < -18000L) {
    centeredCenti = -18000L;
  } else if (centeredCenti > 18000L) {
    centeredCenti = 18000L;
  }
  return static_cast<int16_t>(centeredCenti);
}

uint8_t encodeDriveSource(QuadDriveControlSource source) {
  switch (source) {
    case QuadDriveControlSource::kPi:
      return 1;
    case QuadDriveControlSource::kRc:
      return 2;
    case QuadDriveControlSource::kTelnet:
      return 3;
    case QuadDriveControlSource::kNone:
    default:
      return 0;
  }
}

uint8_t encodeStatusFlags() {
  uint8_t status = kStatusReady;

  QuadDriveRuntimeSnapshot driveSnapshot{};
  if (!quadDriveGetRuntimeSnapshot(driveSnapshot) || !driveSnapshot.valid) {
    return status;
  }

  if (driveSnapshot.piEstopActive) {
    status |= kStatusEstopActive;
  }
  if (driveSnapshot.speedPidFailsafe) {
    status |= kStatusFailsafeActive;
  }
  if (driveSnapshot.piFresh) {
    status |= kStatusPiFresh;
  }

  const uint8_t source = encodeDriveSource(driveSnapshot.source);
  status |= static_cast<uint8_t>((source << kStatusControlSourceShift) & kStatusControlSourceMask);

  if (driveSnapshot.speedPidOverspeed) {
    status |= kStatusOverspeedActive;
  }

  return status;
}

uint8_t encodeAppliedBrakePercent() {
  QuadDriveRuntimeSnapshot driveSnapshot{};
  if (!quadDriveGetRuntimeSnapshot(driveSnapshot) || !driveSnapshot.valid) {
    return 0;
  }
  if (driveSnapshot.appliedBrakePercent > 100u) {
    return 100u;
  }
  return driveSnapshot.appliedBrakePercent;
}

void logRxFrame(const PiCommsConfig& cfg, const PiRxState& state, TickType_t nowTick) {
  if (!cfg.logRx) {
    return;
  }
  static TickType_t s_lastLogTick = 0;
  const TickType_t minInterval = pdMS_TO_TICKS(200);
  if (s_lastLogTick != 0 && (nowTick - s_lastLogTick) < minInterval) {
    return;
  }
  String msg;
  msg.reserve(176);
  msg += "[PI][RX] ";
  msg += describeCommandFlags(state.verFlags);
  msg += " steer=";
  msg += state.steer;
  msg += "%";
  msg += " speedCmd=";
  msg += String(static_cast<float>(state.speedCmdCentiMps) / 100.0f, 2);
  msg += "m/s";
  msg += " speedCmdSigned=";
  msg += String(static_cast<float>(state.speedCmdSignedCentiMps) / 100.0f, 2);
  msg += "m/s";
  msg += " revReq=";
  msg += state.speedReverseRequest ? "Y" : "N";
  msg += " hazard=";
  msg += state.hazardLightRequested ? "Y" : "N";
  msg += " brake=";
  msg += state.brake;
  msg += "%";
  msg += " estop=";
  msg += state.estop ? "Y" : "N";
  msg += " drive=";
  msg += state.driveEnabled ? "Y" : "N";
  msg += " stats{ok=";
  msg += state.framesOk;
  msg += " crcErr=";
  msg += state.framesCrcError;
  msg += " malformed=";
  msg += state.framesMalformed;
  msg += " verErr=";
  msg += state.framesVersionError;
  msg += "}";
  broadcastIf(true, msg);
  s_lastLogTick = nowTick;
}

void logRxError(const PiCommsConfig& cfg, const char* reason, TickType_t nowTick) {
  if (!cfg.logRx) {
    return;
  }
  static TickType_t s_lastErrorLogTick = 0;
  const TickType_t minInterval = pdMS_TO_TICKS(500);
  if (s_lastErrorLogTick != 0 && (nowTick - s_lastErrorLogTick) < minInterval) {
    return;
  }
  PiRxState snapshot{};
  portENTER_CRITICAL(&g_stateMux);
  snapshot = g_rxState;
  portEXIT_CRITICAL(&g_stateMux);
  String msg;
  msg.reserve(144);
  msg += "[PI][RX][WARN] ";
  msg += reason;
  msg += " stats{ok=";
  msg += snapshot.framesOk;
  msg += " crcErr=";
  msg += snapshot.framesCrcError;
  msg += " malformed=";
  msg += snapshot.framesMalformed;
  msg += " verErr=";
  msg += snapshot.framesVersionError;
  msg += "}";
  broadcastIf(true, msg);
  s_lastErrorLogTick = nowTick;
}

