AEyeSecurity/ESP32_SALUS/src/pi_comms.cpp
void logTxFrame(const PiCommsConfig& cfg,
                uint8_t status,
                uint16_t speedCentiMps,
                int16_t steerCentiDeg,
                uint8_t brakePercent,
                TickType_t nowTick) {
  if (!cfg.logTx) {
    return;
  }
  static TickType_t s_lastLogTick = 0;
  const TickType_t minInterval = pdMS_TO_TICKS(1000);
  if (s_lastLogTick != 0 && (nowTick - s_lastLogTick) < minInterval) {
    return;
  }
  String msg;
  msg.reserve(200);
  msg += "[PI][TX] ";
  msg += describeStatusFlags(status);
  msg += " speed=";
  msg += describeSpeedTelemetry(speedCentiMps);
  msg += " steer=";
  msg += describeSteerTelemetry(steerCentiDeg);
  msg += " brake=";
  msg += brakePercent;
  msg += "%";
  broadcastIf(true, msg);
  s_lastLogTick = nowTick;
}

void logBatteryTxFrame(const PiCommsConfig& cfg,
                       uint8_t flags,
                       uint16_t batteryCentiVolts,
                       uint16_t adcPinMv,
                       uint8_t sampleAgeDs,
                       TickType_t nowTick) {
  if (!cfg.logTx) {
    return;
  }
  static TickType_t s_lastLogTick = 0;
  const TickType_t minInterval = pdMS_TO_TICKS(1000);
  if (s_lastLogTick != 0 && (nowTick - s_lastLogTick) < minInterval) {
    return;
  }

  String msg;
  msg.reserve(176);
  msg += "[PI][BAT][TX] ";
  msg += describeBatteryFlags(flags);
  msg += " battery=";
  msg += String(static_cast<float>(batteryCentiVolts) / 100.0f, 2);
  msg += "V";
  msg += " adc=";
  msg += adcPinMv;
  msg += "mV";
  msg += " age=";
  msg += String(static_cast<float>(sampleAgeDs) / 10.0f, 1);
  msg += "s";
  broadcastIf(true, msg);
  s_lastLogTick = nowTick;
}

void IRAM_ATTR onPiRxWakeTimer() {
  BaseType_t taskWoken = pdFALSE;
  TaskHandle_t task = nullptr;
  portENTER_CRITICAL_ISR(&g_piRxWakeMux);
  task = g_piRxWakeTaskHandle;
  portEXIT_CRITICAL_ISR(&g_piRxWakeMux);
  if (task != nullptr) {
    vTaskNotifyGiveFromISR(task, &taskWoken);
    if (taskWoken == pdTRUE) {
      portYIELD_FROM_ISR();
    }
  }
}

}  // namespace

bool piCommsInit(const PiCommsConfig& config) {
  if (g_initialized) {
    return true;
  }

  g_config = config;

  uart_config_t uartCfg{};
  uartCfg.baud_rate = config.baudRate;
  uartCfg.data_bits = UART_DATA_8_BITS;
  uartCfg.parity = UART_PARITY_DISABLE;
  uartCfg.stop_bits = UART_STOP_BITS_1;
  uartCfg.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
  uartCfg.source_clk = UART_SCLK_APB;

  const uart_port_t port = config.uartNum;

  if (uart_param_config(port, &uartCfg) != ESP_OK) {
    return false;
  }
  if (uart_set_pin(port, config.txPin, config.rxPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) != ESP_OK) {
    return false;
  }
  if (uart_driver_install(port, config.rxBufferSize, config.txBufferSize, 0, nullptr, 0) != ESP_OK) {
    return false;
  }

  uart_flush_input(port);

  portENTER_CRITICAL(&g_stateMux);
  g_rxState = PiRxState{};
  g_batteryTxState = PiBatteryTxState{};
  portEXIT_CRITICAL(&g_stateMux);

  g_initialized = true;
  return true;
}

bool piCommsGetRxSnapshot(PiCommsRxSnapshot& snapshot) {
  portENTER_CRITICAL(&g_stateMux);
  snapshot.driverReady = g_initialized;
  snapshot.hasFrame = g_rxState.hasFrame;
  snapshot.lastFrameTick = g_rxState.lastFrameTick;
  snapshot.verFlags = g_rxState.verFlags;
  snapshot.steer = g_rxState.steer;
  snapshot.speedCmdCentiMps = g_rxState.speedCmdCentiMps;
  snapshot.speedCmdSignedCentiMps = g_rxState.speedCmdSignedCentiMps;
  snapshot.speedReverseRequest = g_rxState.speedReverseRequest;
  snapshot.hazardLightRequested = g_rxState.hazardLightRequested;
  snapshot.brake = g_rxState.brake;
  snapshot.driveEnabled = g_rxState.driveEnabled;
  snapshot.estop = g_rxState.estop;
  snapshot.framesOk = g_rxState.framesOk;
  snapshot.framesCrcError = g_rxState.framesCrcError;
  snapshot.framesMalformed = g_rxState.framesMalformed;
  snapshot.framesVersionError = g_rxState.framesVersionError;
  portEXIT_CRITICAL(&g_stateMux);
  return snapshot.driverReady;
}

bool piCommsGetBatteryTxSnapshot(PiCommsBatteryTxSnapshot& snapshot) {
  portENTER_CRITICAL(&g_stateMux);
  snapshot.driverReady = g_initialized;
  snapshot.hasFrame = g_batteryTxState.hasFrame;
  snapshot.lastFrameTick = g_batteryTxState.lastFrameTick;
  snapshot.flags = g_batteryTxState.flags;
  snapshot.batteryCentiVolts = g_batteryTxState.batteryCentiVolts;
  snapshot.adcPinMv = g_batteryTxState.adcPinMv;
  snapshot.sampleAgeDs = g_batteryTxState.sampleAgeDs;
  snapshot.framesSent = g_batteryTxState.framesSent;
  portEXIT_CRITICAL(&g_stateMux);
  return snapshot.driverReady;
}

void piCommsResetStats() {
  portENTER_CRITICAL(&g_stateMux);
  g_rxState.framesOk = 0;
  g_rxState.framesCrcError = 0;
  g_rxState.framesMalformed = 0;
  g_rxState.framesVersionError = 0;
  g_batteryTxState.framesSent = 0;
  portEXIT_CRITICAL(&g_stateMux);
}

void taskPiCommsRx(void* parameter) {
  PiCommsConfig* cfg = static_cast<PiCommsConfig*>(parameter);
  if (cfg == nullptr) {
    broadcastIf(true, "[PI][RX] Configuracion invalida, abortando tarea");
    vTaskDelete(nullptr);
    return;
  }

  const TickType_t period = (cfg->rxTaskPeriod > 0) ? cfg->rxTaskPeriod : pdMS_TO_TICKS(1);
  const uint32_t expectedPeriodUs = static_cast<uint32_t>(period * portTICK_PERIOD_MS * 1000U);
  const uint32_t wakeTimeoutMs = static_cast<uint32_t>(period * portTICK_PERIOD_MS * kPiRxWakeTimeoutFactor);
  TickType_t wakeTimeoutTicks = pdMS_TO_TICKS(wakeTimeoutMs);
  if (wakeTimeoutTicks == 0) {
    wakeTimeoutTicks = 1;
  }
  FrameParser parser;
  const TaskHandle_t selfHandle = xTaskGetCurrentTaskHandle();
  int64_t lastIterationStartUs = esp_timer_get_time();

  bool usePeriodicWakeTimer = false;
  portENTER_CRITICAL(&g_piRxWakeMux);
  if (g_piRxWakeTimer == nullptr) {
    g_piRxWakeTimer = timerBegin(kPiRxWakeTimerIndex, kPiRxWakeTimerDivider, true);
    if (g_piRxWakeTimer != nullptr) {
      timerAttachInterrupt(g_piRxWakeTimer, &onPiRxWakeTimer, true);
    }
  }
  if (g_piRxWakeTimer != nullptr) {
    g_piRxWakeTaskHandle = selfHandle;
    timerAlarmDisable(g_piRxWakeTimer);
    timerAlarmWrite(g_piRxWakeTimer, expectedPeriodUs, true);
    timerAlarmEnable(g_piRxWakeTimer);
    usePeriodicWakeTimer = true;
  }
  portEXIT_CRITICAL(&g_piRxWakeMux);

  std::array<uint8_t, kPiRxReadChunkSize> chunk{};

  while (true) {
    bool notifyTimeout = false;
    if (usePeriodicWakeTimer) {
      const uint32_t notifyCount = ulTaskNotifyTake(pdTRUE, wakeTimeoutTicks);
      notifyTimeout = (notifyCount == 0);
    }

    const int64_t iterationStartUs = esp_timer_get_time();
    uint32_t cycleUs = 0;
    if (iterationStartUs > lastIterationStartUs) {
      cycleUs = static_cast<uint32_t>(iterationStartUs - lastIterationStartUs);
    }
    lastIterationStartUs = iterationStartUs;
    const int len = g_initialized
                        ? uart_read_bytes(cfg->uartNum, chunk.data(), chunk.size(), cfg->rxReadTimeout)
                        : 0;

    if (len > 0) {
      for (int i = 0; i < len; ++i) {
        bool malformed = false;
        uint8_t frame[kRxFrameSize]{};
        const bool complete = parser.feed(chunk[i], frame, malformed);

        if (malformed) {
          portENTER_CRITICAL(&g_stateMux);
          g_rxState.framesMalformed++;
          portEXIT_CRITICAL(&g_stateMux);
          logRxError(*cfg, "Trama mal formada (re-sync)", xTaskGetTickCount());
          continue;
        }

        if (!complete) {
          continue;
        }

        const uint8_t crc = crc8_maxim(frame, kRxFrameSize - 1);
        const uint8_t receivedCrc = frame[kRxFrameSize - 1];
        const TickType_t nowTick = xTaskGetTickCount();

        if (crc != receivedCrc) {
          portENTER_CRITICAL(&g_stateMux);
          g_rxState.framesCrcError++;
          portEXIT_CRITICAL(&g_stateMux);
          logRxError(*cfg, "CRC invalido", nowTick);
          continue;
        }

        const uint8_t version = static_cast<uint8_t>((frame[1] >> 4) & 0x0F);
        if (version != kProtocolVersion) {
          portENTER_CRITICAL(&g_stateMux);
          g_rxState.framesVersionError++;
          portEXIT_CRITICAL(&g_stateMux);
          logRxError(*cfg, "Version de protocolo no soportada", nowTick);
          continue;
        }

        PiRxState newState{};
        newState.hasFrame = true;
        newState.lastFrameTick = nowTick;
        newState.verFlags = frame[1];
        newState.steer = static_cast<int8_t>(frame[2]);
        newState.speedCmdCentiMps =
            static_cast<uint16_t>(frame[3]) | static_cast<uint16_t>(frame[4]) << 8;
        newState.speedReverseRequest = (newState.verFlags & kCmdFlagReverseRequest) != 0;
        newState.hazardLightRequested = (newState.verFlags & kCmdFlagHazardLight) != 0;
        const int32_t speedMagnitude = static_cast<int32_t>(newState.speedCmdCentiMps);
        const int32_t speedSigned = newState.speedReverseRequest ? -speedMagnitude : speedMagnitude;
        newState.speedCmdSignedCentiMps = clampSignedCentiMps(speedSigned);
        newState.brake = frame[5];
        newState.estop = (newState.verFlags & kCmdFlagEstop) != 0;
        newState.driveEnabled = (newState.verFlags & kCmdFlagDriveEnable) != 0;

